data = {}
with open('result_to_compare.txt', 'r', encoding = 'utf-8') as f:
    for line in f:
        if line.split():
            key, value = line.split()
            data[key] = float(value)

data['сравнение (время выполнения синхронного - время выполнения асинхронного)'] = data['синхронно_выполненный_код:'] - data['асинхронно_выполненный_код:'] 

print('----------------------------------------------------------------------------------------------------------')

for key in data.keys():
    print(key, ':', data[key], 'секунды')

print('----------------------------------------------------------------------------------------------------------')
